{"modelTopology": {"keras_version": "2.1.3", "training_config": {"loss_weights": null, "loss": "binary_crossentropy", "optimizer_config": {"class_name": "RMSprop", "config": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-07, "decay": 0.0}}, "metrics": ["accuracy"], "sample_weight_mode": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "kernel_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "batch_input_shape": [null, 150, 150, 3], "strides": [1, 1]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "filters": 32, "kernel_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "activation": "linear", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "kernel_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "activation": "linear", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "units": 64, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "units": 1, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "sigmoid", "trainable": true}}]}, "backend": "tensorflow"}, "weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 32]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_3/bias", "dtype": "float32", "shape": [64]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [18496, 64]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [64]}], "paths": ["group4-shard1of2", "group4-shard2of2"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [64, 1]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [1]}], "paths": ["group5-shard1of1"]}]}