{"weightsManifest": [{"weights": [{"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 32, 32]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [32]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "conv2d_3/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_3/bias", "dtype": "float32", "shape": [64]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [18496, 64]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [64]}], "paths": ["group4-shard1of2", "group4-shard2of2"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [64, 1]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [1]}], "paths": ["group5-shard1of1"]}], "modelTopology": {"keras_version": "2.1.3", "backend": "tensorflow", "model_config": {"config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "dtype": "float32", "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "batch_input_shape": [null, 150, 150, 3], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_regularizer": null, "name": "conv2d_3", "use_bias": true, "trainable": true, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "filters": 64, "activity_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "rate": 0.5, "name": "dropout_1", "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0}, "class_name": "RMSprop"}, "loss_weights": null}}}